In [ ]:
-- Create a Data Base
-- In this interface. Postgres, then we will need to create a DB
-- Connect to a db
-- Querry a database - questions!!

-- Create a table
CREATE TABLE Orders (
  OrderID PRIMARY KEY,
  NameOfFood NOTNULL, 
  CustomerID
  )
  
  
  
CREATE TABLE Customers (
  CustomerID INT PRIMARY KEY,
  CustomerName VARCHAR(50),
  PhoneNumber VARCHAR(20), -- UNIQUE, -- We will nedd to alter the table for this constraint
  Email VARCHAR(10),
  Address_1 VARCHAR(100),
  Address_2 VARCHAR(100),
  OrdersMade INT DEFAULT 0, -- Default value of 0 is given 
  TransactionsDone INT,
  PaymentMethod VARCHAR(100)
  )
  
  
  -- Select a certain number of things using SQL
 SELECT customername, phonenumber,address_1 FROM Customers
 
 -- Select all the columnsCustomers
 select * from Customers
 
INSERT Into Customers ( customerid, customername, phonenumber, email, address_1, address_2, ordersmade, transactionsdone, paymentmethod)
VALUES 
(1,'idrees', 007700007, 'mib@gmail.com','kashmir', NULL , 32, 35, 'cash' )


 
INSERT Into Customers ( customerid, customername, phonenumber, email, address_1, address_2, ordersmade, transactionsdone, paymentmethod)
               VALUES (    2,          'Samson',  007700007,  'samson@gmail.com'  ,  'Selangor', NULL , 15, 15, 'online' )
                
 
 
 INSERT Into Customers ( customerid, customername, phonenumber, email, address_1, address_2, ordersmade, transactionsdone, paymentmethod)
 VALUES 
(3,'Hariz', 007700007, 'hariz@gmail.com','Wilayah', NULL , 25, 24, 'online' ),
(4,'Balqis', 007700007, 'balqis@gmail.com','Pahang', NULL , 15, 15, 'online' ),
(5,'Khairul', 007700007, 'kn@gmail.com','Selangor', NULL , 45, 45, 'cash' ),
(6,'Hafiz', 007700007, 'hf@gmail.com','Wilayah', NULL , 52, 42, 'cash' ),
(7,'Ameer', 007700007, 'am@gmail.com','Selangor', NULL , 70, 65, 'online' )

 
 Create TABLE Orders ( 
   OrderID INT PRIMARY KEY,
   -- CustomerID INT REFERENCES Customers(customerid)
   CustomerID INT NOTNULL,
   NameOfFood VARCHAR(10) NOTNULL,
   RestaurantName VARCHAR(20) NOTNULL,
   RestaurantLocation VARCHAR(20) NOTNULL,
   OrderLocation VARCHAR(20) NOTNULL,
   Price FLOAT(10, 2), -- stores 10 digits, 2 decimal points
   Quantity INT DEFAULT 1,
   OrderDate TIMESTAMP DEFAULT CURRENT_TIMESTAMP
 )
 
 INSERT Into Orders ( orderid)
 VALUES 
(3,'Hariz', 007700007, 'hariz@gmail.com','Wilayah', NULL , 25, 24, 'online' )


-- fill these tables with 20 new valuesCustomers
-- can use ai as well